Model: "efficientnet-lite-b0"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1_0 (InputLayer)          (None, 480, 640, 3)  0                                            
__________________________________________________________________________________________________
efficientnet-lite0/model/stem/c (None, 240, 320, 32) 864         input_1_0[0][0]                  
__________________________________________________________________________________________________
efficientnet-lite0/model/stem/t (None, 240, 320, 32) 128         efficientnet-lite0/model/stem/con
__________________________________________________________________________________________________
efficientnet-lite0/model/stem/R (None, 240, 320, 32) 0           efficientnet-lite0/model/stem/tpu
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 240, 320, 32) 288         efficientnet-lite0/model/stem/Rel
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 240, 320, 32) 128         efficientnet-lite0/model/blocks_0
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 240, 320, 32) 0           efficientnet-lite0/model/blocks_0
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 240, 320, 16) 512         efficientnet-lite0/model/blocks_0
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 240, 320, 16) 64          efficientnet-lite0/model/blocks_0
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 240, 320, 96) 1536        efficientnet-lite0/model/blocks_0
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 240, 320, 96) 384         efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 240, 320, 96) 0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 96) 864         efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 96) 384         efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 96) 0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 24) 2304        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 24) 96          efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 144 3456        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 144 576         efficientnet-lite0/model/blocks_2
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 144 0           efficientnet-lite0/model/blocks_2
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 144 1296        efficientnet-lite0/model/blocks_2
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 144 576         efficientnet-lite0/model/blocks_2
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 144 0           efficientnet-lite0/model/blocks_2
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 24) 3456        efficientnet-lite0/model/blocks_2
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 24) 96          efficientnet-lite0/model/blocks_2
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 24) 0           efficientnet-lite0/model/blocks_2
                                                                 efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 144 3456        efficientnet-lite0/model/blocks_2
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 144 576         efficientnet-lite0/model/blocks_3
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 120, 160, 144 0           efficientnet-lite0/model/blocks_3
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 144)  3600        efficientnet-lite0/model/blocks_3
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 144)  576         efficientnet-lite0/model/blocks_3
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 144)  0           efficientnet-lite0/model/blocks_3
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 40)   5760        efficientnet-lite0/model/blocks_3
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 40)   160         efficientnet-lite0/model/blocks_3
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 240)  9600        efficientnet-lite0/model/blocks_3
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 240)  960         efficientnet-lite0/model/blocks_4
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 240)  0           efficientnet-lite0/model/blocks_4
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 240)  6000        efficientnet-lite0/model/blocks_4
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 240)  960         efficientnet-lite0/model/blocks_4
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 240)  0           efficientnet-lite0/model/blocks_4
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 40)   9600        efficientnet-lite0/model/blocks_4
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 40)   160         efficientnet-lite0/model/blocks_4
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 40)   0           efficientnet-lite0/model/blocks_4
                                                                 efficientnet-lite0/model/blocks_3
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 240)  9600        efficientnet-lite0/model/blocks_4
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 240)  960         efficientnet-lite0/model/blocks_5
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 60, 80, 240)  0           efficientnet-lite0/model/blocks_5
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 240)  2160        efficientnet-lite0/model/blocks_5
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 240)  960         efficientnet-lite0/model/blocks_5
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 240)  0           efficientnet-lite0/model/blocks_5
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 80)   19200       efficientnet-lite0/model/blocks_5
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 80)   320         efficientnet-lite0/model/blocks_5
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  38400       efficientnet-lite0/model/blocks_5
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  1920        efficientnet-lite0/model/blocks_6
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  0           efficientnet-lite0/model/blocks_6
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  4320        efficientnet-lite0/model/blocks_6
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  1920        efficientnet-lite0/model/blocks_6
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  0           efficientnet-lite0/model/blocks_6
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 80)   38400       efficientnet-lite0/model/blocks_6
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 80)   320         efficientnet-lite0/model/blocks_6
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 80)   0           efficientnet-lite0/model/blocks_6
                                                                 efficientnet-lite0/model/blocks_5
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  38400       efficientnet-lite0/model/blocks_6
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  1920        efficientnet-lite0/model/blocks_7
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  0           efficientnet-lite0/model/blocks_7
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  4320        efficientnet-lite0/model/blocks_7
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  1920        efficientnet-lite0/model/blocks_7
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  0           efficientnet-lite0/model/blocks_7
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 80)   38400       efficientnet-lite0/model/blocks_7
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 80)   320         efficientnet-lite0/model/blocks_7
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 80)   0           efficientnet-lite0/model/blocks_7
                                                                 efficientnet-lite0/model/blocks_6
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  38400       efficientnet-lite0/model/blocks_7
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  1920        efficientnet-lite0/model/blocks_8
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  0           efficientnet-lite0/model/blocks_8
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  12000       efficientnet-lite0/model/blocks_8
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  1920        efficientnet-lite0/model/blocks_8
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 480)  0           efficientnet-lite0/model/blocks_8
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 112)  53760       efficientnet-lite0/model/blocks_8
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 112)  448         efficientnet-lite0/model/blocks_8
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  75264       efficientnet-lite0/model/blocks_8
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  2688        efficientnet-lite0/model/blocks_9
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  0           efficientnet-lite0/model/blocks_9
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  16800       efficientnet-lite0/model/blocks_9
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  2688        efficientnet-lite0/model/blocks_9
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  0           efficientnet-lite0/model/blocks_9
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 112)  75264       efficientnet-lite0/model/blocks_9
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 112)  448         efficientnet-lite0/model/blocks_9
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 112)  0           efficientnet-lite0/model/blocks_9
                                                                 efficientnet-lite0/model/blocks_8
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  75264       efficientnet-lite0/model/blocks_9
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  2688        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  16800       efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  2688        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 112)  75264       efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 112)  448         efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 112)  0           efficientnet-lite0/model/blocks_1
                                                                 efficientnet-lite0/model/blocks_9
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  75264       efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  2688        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 30, 40, 672)  0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 672)  16800       efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 672)  2688        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 672)  0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 192)  129024      efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 192)  768         efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 221184      efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 4608        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 28800       efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 4608        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 192)  221184      efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 192)  768         efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 192)  0           efficientnet-lite0/model/blocks_1
                                                                 efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 221184      efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 4608        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 28800       efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 4608        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 192)  221184      efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 192)  768         efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 192)  0           efficientnet-lite0/model/blocks_1
                                                                 efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 221184      efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 4608        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 28800       efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 4608        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 192)  221184      efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 192)  768         efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 192)  0           efficientnet-lite0/model/blocks_1
                                                                 efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 221184      efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 4608        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 10368       efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 4608        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 1152) 0           efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 320)  368640      efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/blocks (None, 15, 20, 320)  1280        efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/head/c (None, 15, 20, 1280) 409600      efficientnet-lite0/model/blocks_1
__________________________________________________________________________________________________
efficientnet-lite0/model/head/t (None, 15, 20, 1280) 5120        efficientnet-lite0/model/head/con
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 15, 20, 1280) 0           efficientnet-lite0/model/head/tpu
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 1280)         0           re_lu[0][0]                      
__________________________________________________________________________________________________
dense (Dense)                   (None, 1000)         1281000     global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
softmax (Softmax)               (None, 1000)         0           dense[0][0]                      
==================================================================================================
Total params: 4,694,024
Trainable params: 4,652,008
Non-trainable params: 42,016
__________________________________________________________________________________________________

input_1_0 (None, 480, 640, 3)
efficientnet-lite0/model/stem/conv2d/Conv2D_0 (None, 240, 320, 32)
efficientnet-lite0/model/stem/tpu_batch_normalization/FusedBatchNormV3_0 (None, 240, 320, 32)
efficientnet-lite0/model/stem/Relu6_0 (None, 240, 320, 32)
efficientnet-lite0/model/blocks_0/depthwise_conv2d/depthwise_0 (None, 240, 320, 32)
efficientnet-lite0/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3_0 (None, 240, 320, 32)
efficientnet-lite0/model/blocks_0/Relu6_0 (None, 240, 320, 32)
efficientnet-lite0/model/blocks_0/conv2d/Conv2D_0 (None, 240, 320, 16)
efficientnet-lite0/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 240, 320, 16)
efficientnet-lite0/model/blocks_1/conv2d/Conv2D_0 (None, 240, 320, 96)
efficientnet-lite0/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3_0 (None, 240, 320, 96)
efficientnet-lite0/model/blocks_1/Relu6_0 (None, 240, 320, 96)
efficientnet-lite0/model/blocks_1/depthwise_conv2d/depthwise_0 (None, 120, 160, 96)
efficientnet-lite0/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 120, 160, 96)
efficientnet-lite0/model/blocks_1/Relu6_1_0 (None, 120, 160, 96)
efficientnet-lite0/model/blocks_1/conv2d_1/Conv2D_0 (None, 120, 160, 24)
efficientnet-lite0/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 120, 160, 24)
efficientnet-lite0/model/blocks_2/conv2d/Conv2D_0 (None, 120, 160, 144)
efficientnet-lite0/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3_0 (None, 120, 160, 144)
efficientnet-lite0/model/blocks_2/Relu6_0 (None, 120, 160, 144)
efficientnet-lite0/model/blocks_2/depthwise_conv2d/depthwise_0 (None, 120, 160, 144)
efficientnet-lite0/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 120, 160, 144)
efficientnet-lite0/model/blocks_2/Relu6_1_0 (None, 120, 160, 144)
efficientnet-lite0/model/blocks_2/conv2d_1/Conv2D_0 (None, 120, 160, 24)
efficientnet-lite0/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 120, 160, 24)
efficientnet-lite0/model/blocks_2/Add_0 (None, 120, 160, 24)
efficientnet-lite0/model/blocks_3/conv2d/Conv2D_0 (None, 120, 160, 144)
efficientnet-lite0/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3_0 (None, 120, 160, 144)
efficientnet-lite0/model/blocks_3/Relu6_0 (None, 120, 160, 144)
efficientnet-lite0/model/blocks_3/depthwise_conv2d/depthwise_0 (None, 60, 80, 144)
efficientnet-lite0/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 60, 80, 144)
efficientnet-lite0/model/blocks_3/Relu6_1_0 (None, 60, 80, 144)
efficientnet-lite0/model/blocks_3/conv2d_1/Conv2D_0 (None, 60, 80, 40)
efficientnet-lite0/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 60, 80, 40)
efficientnet-lite0/model/blocks_4/conv2d/Conv2D_0 (None, 60, 80, 240)
efficientnet-lite0/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3_0 (None, 60, 80, 240)
efficientnet-lite0/model/blocks_4/Relu6_0 (None, 60, 80, 240)
efficientnet-lite0/model/blocks_4/depthwise_conv2d/depthwise_0 (None, 60, 80, 240)
efficientnet-lite0/model/blocks_4/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 60, 80, 240)
efficientnet-lite0/model/blocks_4/Relu6_1_0 (None, 60, 80, 240)
efficientnet-lite0/model/blocks_4/conv2d_1/Conv2D_0 (None, 60, 80, 40)
efficientnet-lite0/model/blocks_4/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 60, 80, 40)
efficientnet-lite0/model/blocks_4/Add_0 (None, 60, 80, 40)
efficientnet-lite0/model/blocks_5/conv2d/Conv2D_0 (None, 60, 80, 240)
efficientnet-lite0/model/blocks_5/tpu_batch_normalization/FusedBatchNormV3_0 (None, 60, 80, 240)
efficientnet-lite0/model/blocks_5/Relu6_0 (None, 60, 80, 240)
efficientnet-lite0/model/blocks_5/depthwise_conv2d/depthwise_0 (None, 30, 40, 240)
efficientnet-lite0/model/blocks_5/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 30, 40, 240)
efficientnet-lite0/model/blocks_5/Relu6_1_0 (None, 30, 40, 240)
efficientnet-lite0/model/blocks_5/conv2d_1/Conv2D_0 (None, 30, 40, 80)
efficientnet-lite0/model/blocks_5/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 30, 40, 80)
efficientnet-lite0/model/blocks_6/conv2d/Conv2D_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_6/tpu_batch_normalization/FusedBatchNormV3_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_6/Relu6_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_6/depthwise_conv2d/depthwise_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_6/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_6/Relu6_1_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_6/conv2d_1/Conv2D_0 (None, 30, 40, 80)
efficientnet-lite0/model/blocks_6/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 30, 40, 80)
efficientnet-lite0/model/blocks_6/Add_0 (None, 30, 40, 80)
efficientnet-lite0/model/blocks_7/conv2d/Conv2D_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_7/tpu_batch_normalization/FusedBatchNormV3_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_7/Relu6_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_7/depthwise_conv2d/depthwise_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_7/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_7/Relu6_1_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_7/conv2d_1/Conv2D_0 (None, 30, 40, 80)
efficientnet-lite0/model/blocks_7/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 30, 40, 80)
efficientnet-lite0/model/blocks_7/Add_0 (None, 30, 40, 80)
efficientnet-lite0/model/blocks_8/conv2d/Conv2D_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_8/tpu_batch_normalization/FusedBatchNormV3_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_8/Relu6_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_8/depthwise_conv2d/depthwise_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_8/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_8/Relu6_1_0 (None, 30, 40, 480)
efficientnet-lite0/model/blocks_8/conv2d_1/Conv2D_0 (None, 30, 40, 112)
efficientnet-lite0/model/blocks_8/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 30, 40, 112)
efficientnet-lite0/model/blocks_9/conv2d/Conv2D_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_9/tpu_batch_normalization/FusedBatchNormV3_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_9/Relu6_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_9/depthwise_conv2d/depthwise_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_9/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_9/Relu6_1_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_9/conv2d_1/Conv2D_0 (None, 30, 40, 112)
efficientnet-lite0/model/blocks_9/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 30, 40, 112)
efficientnet-lite0/model/blocks_9/Add_0 (None, 30, 40, 112)
efficientnet-lite0/model/blocks_10/conv2d/Conv2D_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_10/tpu_batch_normalization/FusedBatchNormV3_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_10/Relu6_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_10/depthwise_conv2d/depthwise_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_10/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_10/Relu6_1_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_10/conv2d_1/Conv2D_0 (None, 30, 40, 112)
efficientnet-lite0/model/blocks_10/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 30, 40, 112)
efficientnet-lite0/model/blocks_10/Add_0 (None, 30, 40, 112)
efficientnet-lite0/model/blocks_11/conv2d/Conv2D_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_11/tpu_batch_normalization/FusedBatchNormV3_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_11/Relu6_0 (None, 30, 40, 672)
efficientnet-lite0/model/blocks_11/depthwise_conv2d/depthwise_0 (None, 15, 20, 672)
efficientnet-lite0/model/blocks_11/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 15, 20, 672)
efficientnet-lite0/model/blocks_11/Relu6_1_0 (None, 15, 20, 672)
efficientnet-lite0/model/blocks_11/conv2d_1/Conv2D_0 (None, 15, 20, 192)
efficientnet-lite0/model/blocks_11/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 15, 20, 192)
efficientnet-lite0/model/blocks_12/conv2d/Conv2D_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_12/tpu_batch_normalization/FusedBatchNormV3_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_12/Relu6_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_12/depthwise_conv2d/depthwise_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_12/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_12/Relu6_1_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_12/conv2d_1/Conv2D_0 (None, 15, 20, 192)
efficientnet-lite0/model/blocks_12/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 15, 20, 192)
efficientnet-lite0/model/blocks_12/Add_0 (None, 15, 20, 192)
efficientnet-lite0/model/blocks_13/conv2d/Conv2D_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_13/tpu_batch_normalization/FusedBatchNormV3_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_13/Relu6_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_13/depthwise_conv2d/depthwise_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_13/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_13/Relu6_1_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_13/conv2d_1/Conv2D_0 (None, 15, 20, 192)
efficientnet-lite0/model/blocks_13/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 15, 20, 192)
efficientnet-lite0/model/blocks_13/Add_0 (None, 15, 20, 192)
efficientnet-lite0/model/blocks_14/conv2d/Conv2D_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_14/tpu_batch_normalization/FusedBatchNormV3_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_14/Relu6_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_14/depthwise_conv2d/depthwise_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_14/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_14/Relu6_1_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_14/conv2d_1/Conv2D_0 (None, 15, 20, 192)
efficientnet-lite0/model/blocks_14/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 15, 20, 192)
efficientnet-lite0/model/blocks_14/Add_0 (None, 15, 20, 192)
efficientnet-lite0/model/blocks_15/conv2d/Conv2D_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_15/tpu_batch_normalization/FusedBatchNormV3_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_15/Relu6_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_15/depthwise_conv2d/depthwise_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_15/tpu_batch_normalization_1/FusedBatchNormV3_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_15/Relu6_1_0 (None, 15, 20, 1152)
efficientnet-lite0/model/blocks_15/conv2d_1/Conv2D_0 (None, 15, 20, 320)
efficientnet-lite0/model/blocks_15/tpu_batch_normalization_2/FusedBatchNormV3_0 (None, 15, 20, 320)
efficientnet-lite0/model/head/conv2d/Conv2D_0 (None, 15, 20, 1280)
efficientnet-lite0/model/head/tpu_batch_normalization/FusedBatchNormV3_raw_output___3_0 (None, 15, 20, 1280)
re_lu (None, 15, 20, 1280)
global_average_pooling2d (None, 1280)
dense (None, 1000)
softmax (None, 1000)