Model: "MobilenetV3large"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 480, 640, 3)  0                                            
__________________________________________________________________________________________________
Conv_pad (ZeroPadding2D)        (None, 481, 641, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
Conv (Conv2D)                   (None, 240, 320, 16) 432         Conv_pad[0][0]                   
__________________________________________________________________________________________________
Conv/BatchNorm (BatchNormalizat (None, 240, 320, 16) 64          Conv[0][0]                       
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 240, 320, 16) 0           Conv/BatchNorm[0][0]             
__________________________________________________________________________________________________
expanded_conv/depthwise (Depthw (None, 240, 320, 16) 144         activation_1[0][0]               
__________________________________________________________________________________________________
expanded_conv/depthwise/BatchNo (None, 240, 320, 16) 64          expanded_conv/depthwise[0][0]    
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 240, 320, 16) 0           expanded_conv/depthwise/BatchNorm
__________________________________________________________________________________________________
expanded_conv/project (Conv2D)  (None, 240, 320, 16) 256         activation_2[0][0]               
__________________________________________________________________________________________________
expanded_conv/project/BatchNorm (None, 240, 320, 16) 64          expanded_conv/project[0][0]      
__________________________________________________________________________________________________
expanded_conv/Add (Add)         (None, 240, 320, 16) 0           activation_1[0][0]               
                                                                 expanded_conv/project/BatchNorm[0
__________________________________________________________________________________________________
expanded_conv_1/expand (Conv2D) (None, 240, 320, 64) 1024        expanded_conv/Add[0][0]          
__________________________________________________________________________________________________
expanded_conv_1/expand/BatchNor (None, 240, 320, 64) 256         expanded_conv_1/expand[0][0]     
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 240, 320, 64) 0           expanded_conv_1/expand/BatchNorm[
__________________________________________________________________________________________________
expanded_conv_1/depthwise/pad ( (None, 241, 321, 64) 0           activation_3[0][0]               
__________________________________________________________________________________________________
expanded_conv_1/depthwise (Dept (None, 120, 160, 64) 576         expanded_conv_1/depthwise/pad[0][
__________________________________________________________________________________________________
expanded_conv_1/depthwise/Batch (None, 120, 160, 64) 256         expanded_conv_1/depthwise[0][0]  
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 120, 160, 64) 0           expanded_conv_1/depthwise/BatchNo
__________________________________________________________________________________________________
expanded_conv_1/project (Conv2D (None, 120, 160, 24) 1536        activation_4[0][0]               
__________________________________________________________________________________________________
expanded_conv_1/project/BatchNo (None, 120, 160, 24) 96          expanded_conv_1/project[0][0]    
__________________________________________________________________________________________________
expanded_conv_2/expand (Conv2D) (None, 120, 160, 72) 1728        expanded_conv_1/project/BatchNorm
__________________________________________________________________________________________________
expanded_conv_2/expand/BatchNor (None, 120, 160, 72) 288         expanded_conv_2/expand[0][0]     
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 120, 160, 72) 0           expanded_conv_2/expand/BatchNorm[
__________________________________________________________________________________________________
expanded_conv_2/depthwise (Dept (None, 120, 160, 72) 648         activation_5[0][0]               
__________________________________________________________________________________________________
expanded_conv_2/depthwise/Batch (None, 120, 160, 72) 288         expanded_conv_2/depthwise[0][0]  
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 120, 160, 72) 0           expanded_conv_2/depthwise/BatchNo
__________________________________________________________________________________________________
expanded_conv_2/project (Conv2D (None, 120, 160, 24) 1728        activation_6[0][0]               
__________________________________________________________________________________________________
expanded_conv_2/project/BatchNo (None, 120, 160, 24) 96          expanded_conv_2/project[0][0]    
__________________________________________________________________________________________________
expanded_conv_2/Add (Add)       (None, 120, 160, 24) 0           expanded_conv_1/project/BatchNorm
                                                                 expanded_conv_2/project/BatchNorm
__________________________________________________________________________________________________
expanded_conv_3/expand (Conv2D) (None, 120, 160, 72) 1728        expanded_conv_2/Add[0][0]        
__________________________________________________________________________________________________
expanded_conv_3/expand/BatchNor (None, 120, 160, 72) 288         expanded_conv_3/expand[0][0]     
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 120, 160, 72) 0           expanded_conv_3/expand/BatchNorm[
__________________________________________________________________________________________________
expanded_conv_3/depthwise/pad ( (None, 121, 161, 72) 0           activation_7[0][0]               
__________________________________________________________________________________________________
expanded_conv_3/depthwise (Dept (None, 60, 80, 72)   648         expanded_conv_3/depthwise/pad[0][
__________________________________________________________________________________________________
expanded_conv_3/depthwise/Batch (None, 60, 80, 72)   288         expanded_conv_3/depthwise[0][0]  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 60, 80, 72)   0           expanded_conv_3/depthwise/BatchNo
__________________________________________________________________________________________________
expanded_conv_3/project (Conv2D (None, 60, 80, 40)   2880        activation_8[0][0]               
__________________________________________________________________________________________________
expanded_conv_3/project/BatchNo (None, 60, 80, 40)   160         expanded_conv_3/project[0][0]    
__________________________________________________________________________________________________
expanded_conv_4/expand (Conv2D) (None, 60, 80, 120)  4800        expanded_conv_3/project/BatchNorm
__________________________________________________________________________________________________
expanded_conv_4/expand/BatchNor (None, 60, 80, 120)  480         expanded_conv_4/expand[0][0]     
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 60, 80, 120)  0           expanded_conv_4/expand/BatchNorm[
__________________________________________________________________________________________________
expanded_conv_4/depthwise (Dept (None, 60, 80, 120)  1080        activation_9[0][0]               
__________________________________________________________________________________________________
expanded_conv_4/depthwise/Batch (None, 60, 80, 120)  480         expanded_conv_4/depthwise[0][0]  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 60, 80, 120)  0           expanded_conv_4/depthwise/BatchNo
__________________________________________________________________________________________________
expanded_conv_4/project (Conv2D (None, 60, 80, 40)   4800        activation_10[0][0]              
__________________________________________________________________________________________________
expanded_conv_4/project/BatchNo (None, 60, 80, 40)   160         expanded_conv_4/project[0][0]    
__________________________________________________________________________________________________
expanded_conv_4/Add (Add)       (None, 60, 80, 40)   0           expanded_conv_3/project/BatchNorm
                                                                 expanded_conv_4/project/BatchNorm
__________________________________________________________________________________________________
expanded_conv_5/expand (Conv2D) (None, 60, 80, 120)  4800        expanded_conv_4/Add[0][0]        
__________________________________________________________________________________________________
expanded_conv_5/expand/BatchNor (None, 60, 80, 120)  480         expanded_conv_5/expand[0][0]     
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 60, 80, 120)  0           expanded_conv_5/expand/BatchNorm[
__________________________________________________________________________________________________
expanded_conv_5/depthwise (Dept (None, 60, 80, 120)  1080        activation_11[0][0]              
__________________________________________________________________________________________________
expanded_conv_5/depthwise/Batch (None, 60, 80, 120)  480         expanded_conv_5/depthwise[0][0]  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 60, 80, 120)  0           expanded_conv_5/depthwise/BatchNo
__________________________________________________________________________________________________
expanded_conv_5/project (Conv2D (None, 60, 80, 40)   4800        activation_12[0][0]              
__________________________________________________________________________________________________
expanded_conv_5/project/BatchNo (None, 60, 80, 40)   160         expanded_conv_5/project[0][0]    
__________________________________________________________________________________________________
expanded_conv_5/Add (Add)       (None, 60, 80, 40)   0           expanded_conv_4/Add[0][0]        
                                                                 expanded_conv_5/project/BatchNorm
__________________________________________________________________________________________________
expanded_conv_6/expand (Conv2D) (None, 60, 80, 240)  9600        expanded_conv_5/Add[0][0]        
__________________________________________________________________________________________________
expanded_conv_6/expand/BatchNor (None, 60, 80, 240)  960         expanded_conv_6/expand[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 60, 80, 240)  0           expanded_conv_6/expand/BatchNorm[
__________________________________________________________________________________________________
expanded_conv_6/depthwise/pad ( (None, 61, 81, 240)  0           activation_13[0][0]              
__________________________________________________________________________________________________
expanded_conv_6/depthwise (Dept (None, 30, 40, 240)  2160        expanded_conv_6/depthwise/pad[0][
__________________________________________________________________________________________________
expanded_conv_6/depthwise/Batch (None, 30, 40, 240)  960         expanded_conv_6/depthwise[0][0]  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 30, 40, 240)  0           expanded_conv_6/depthwise/BatchNo
__________________________________________________________________________________________________
expanded_conv_6/project (Conv2D (None, 30, 40, 80)   19200       activation_14[0][0]              
__________________________________________________________________________________________________
expanded_conv_6/project/BatchNo (None, 30, 40, 80)   320         expanded_conv_6/project[0][0]    
__________________________________________________________________________________________________
expanded_conv_7/expand (Conv2D) (None, 30, 40, 200)  16000       expanded_conv_6/project/BatchNorm
__________________________________________________________________________________________________
expanded_conv_7/expand/BatchNor (None, 30, 40, 200)  800         expanded_conv_7/expand[0][0]     
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 30, 40, 200)  0           expanded_conv_7/expand/BatchNorm[
__________________________________________________________________________________________________
expanded_conv_7/depthwise (Dept (None, 30, 40, 200)  1800        activation_15[0][0]              
__________________________________________________________________________________________________
expanded_conv_7/depthwise/Batch (None, 30, 40, 200)  800         expanded_conv_7/depthwise[0][0]  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 30, 40, 200)  0           expanded_conv_7/depthwise/BatchNo
__________________________________________________________________________________________________
expanded_conv_7/project (Conv2D (None, 30, 40, 80)   16000       activation_16[0][0]              
__________________________________________________________________________________________________
expanded_conv_7/project/BatchNo (None, 30, 40, 80)   320         expanded_conv_7/project[0][0]    
__________________________________________________________________________________________________
expanded_conv_7/Add (Add)       (None, 30, 40, 80)   0           expanded_conv_6/project/BatchNorm
                                                                 expanded_conv_7/project/BatchNorm
__________________________________________________________________________________________________
expanded_conv_8/expand (Conv2D) (None, 30, 40, 184)  14720       expanded_conv_7/Add[0][0]        
__________________________________________________________________________________________________
expanded_conv_8/expand/BatchNor (None, 30, 40, 184)  736         expanded_conv_8/expand[0][0]     
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 30, 40, 184)  0           expanded_conv_8/expand/BatchNorm[
__________________________________________________________________________________________________
expanded_conv_8/depthwise (Dept (None, 30, 40, 184)  1656        activation_17[0][0]              
__________________________________________________________________________________________________
expanded_conv_8/depthwise/Batch (None, 30, 40, 184)  736         expanded_conv_8/depthwise[0][0]  
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 30, 40, 184)  0           expanded_conv_8/depthwise/BatchNo
__________________________________________________________________________________________________
expanded_conv_8/project (Conv2D (None, 30, 40, 80)   14720       activation_18[0][0]              
__________________________________________________________________________________________________
expanded_conv_8/project/BatchNo (None, 30, 40, 80)   320         expanded_conv_8/project[0][0]    
__________________________________________________________________________________________________
expanded_conv_8/Add (Add)       (None, 30, 40, 80)   0           expanded_conv_7/Add[0][0]        
                                                                 expanded_conv_8/project/BatchNorm
__________________________________________________________________________________________________
expanded_conv_9/expand (Conv2D) (None, 30, 40, 184)  14720       expanded_conv_8/Add[0][0]        
__________________________________________________________________________________________________
expanded_conv_9/expand/BatchNor (None, 30, 40, 184)  736         expanded_conv_9/expand[0][0]     
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 30, 40, 184)  0           expanded_conv_9/expand/BatchNorm[
__________________________________________________________________________________________________
expanded_conv_9/depthwise (Dept (None, 30, 40, 184)  1656        activation_19[0][0]              
__________________________________________________________________________________________________
expanded_conv_9/depthwise/Batch (None, 30, 40, 184)  736         expanded_conv_9/depthwise[0][0]  
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 30, 40, 184)  0           expanded_conv_9/depthwise/BatchNo
__________________________________________________________________________________________________
expanded_conv_9/project (Conv2D (None, 30, 40, 80)   14720       activation_20[0][0]              
__________________________________________________________________________________________________
expanded_conv_9/project/BatchNo (None, 30, 40, 80)   320         expanded_conv_9/project[0][0]    
__________________________________________________________________________________________________
expanded_conv_9/Add (Add)       (None, 30, 40, 80)   0           expanded_conv_8/Add[0][0]        
                                                                 expanded_conv_9/project/BatchNorm
__________________________________________________________________________________________________
expanded_conv_10/expand (Conv2D (None, 30, 40, 480)  38400       expanded_conv_9/Add[0][0]        
__________________________________________________________________________________________________
expanded_conv_10/expand/BatchNo (None, 30, 40, 480)  1920        expanded_conv_10/expand[0][0]    
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 30, 40, 480)  0           expanded_conv_10/expand/BatchNorm
__________________________________________________________________________________________________
expanded_conv_10/depthwise (Dep (None, 30, 40, 480)  4320        activation_21[0][0]              
__________________________________________________________________________________________________
expanded_conv_10/depthwise/Batc (None, 30, 40, 480)  1920        expanded_conv_10/depthwise[0][0] 
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 30, 40, 480)  0           expanded_conv_10/depthwise/BatchN
__________________________________________________________________________________________________
expanded_conv_10/project (Conv2 (None, 30, 40, 112)  53760       activation_22[0][0]              
__________________________________________________________________________________________________
expanded_conv_10/project/BatchN (None, 30, 40, 112)  448         expanded_conv_10/project[0][0]   
__________________________________________________________________________________________________
expanded_conv_11/expand (Conv2D (None, 30, 40, 672)  75264       expanded_conv_10/project/BatchNor
__________________________________________________________________________________________________
expanded_conv_11/expand/BatchNo (None, 30, 40, 672)  2688        expanded_conv_11/expand[0][0]    
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 30, 40, 672)  0           expanded_conv_11/expand/BatchNorm
__________________________________________________________________________________________________
expanded_conv_11/depthwise (Dep (None, 30, 40, 672)  6048        activation_23[0][0]              
__________________________________________________________________________________________________
expanded_conv_11/depthwise/Batc (None, 30, 40, 672)  2688        expanded_conv_11/depthwise[0][0] 
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 30, 40, 672)  0           expanded_conv_11/depthwise/BatchN
__________________________________________________________________________________________________
expanded_conv_11/project (Conv2 (None, 30, 40, 112)  75264       activation_24[0][0]              
__________________________________________________________________________________________________
expanded_conv_11/project/BatchN (None, 30, 40, 112)  448         expanded_conv_11/project[0][0]   
__________________________________________________________________________________________________
expanded_conv_11/Add (Add)      (None, 30, 40, 112)  0           expanded_conv_10/project/BatchNor
                                                                 expanded_conv_11/project/BatchNor
__________________________________________________________________________________________________
expanded_conv_12/expand (Conv2D (None, 30, 40, 672)  75264       expanded_conv_11/Add[0][0]       
__________________________________________________________________________________________________
expanded_conv_12/expand/BatchNo (None, 30, 40, 672)  2688        expanded_conv_12/expand[0][0]    
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 30, 40, 672)  0           expanded_conv_12/expand/BatchNorm
__________________________________________________________________________________________________
expanded_conv_12/depthwise/pad  (None, 31, 41, 672)  0           activation_25[0][0]              
__________________________________________________________________________________________________
expanded_conv_12/depthwise (Dep (None, 15, 20, 672)  6048        expanded_conv_12/depthwise/pad[0]
__________________________________________________________________________________________________
expanded_conv_12/depthwise/Batc (None, 15, 20, 672)  2688        expanded_conv_12/depthwise[0][0] 
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 15, 20, 672)  0           expanded_conv_12/depthwise/BatchN
__________________________________________________________________________________________________
expanded_conv_12/project (Conv2 (None, 15, 20, 160)  107520      activation_26[0][0]              
__________________________________________________________________________________________________
expanded_conv_12/project/BatchN (None, 15, 20, 160)  640         expanded_conv_12/project[0][0]   
__________________________________________________________________________________________________
expanded_conv_13/expand (Conv2D (None, 15, 20, 960)  153600      expanded_conv_12/project/BatchNor
__________________________________________________________________________________________________
expanded_conv_13/expand/BatchNo (None, 15, 20, 960)  3840        expanded_conv_13/expand[0][0]    
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 15, 20, 960)  0           expanded_conv_13/expand/BatchNorm
__________________________________________________________________________________________________
expanded_conv_13/depthwise (Dep (None, 15, 20, 960)  8640        activation_27[0][0]              
__________________________________________________________________________________________________
expanded_conv_13/depthwise/Batc (None, 15, 20, 960)  3840        expanded_conv_13/depthwise[0][0] 
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 15, 20, 960)  0           expanded_conv_13/depthwise/BatchN
__________________________________________________________________________________________________
expanded_conv_13/project (Conv2 (None, 15, 20, 160)  153600      activation_28[0][0]              
__________________________________________________________________________________________________
expanded_conv_13/project/BatchN (None, 15, 20, 160)  640         expanded_conv_13/project[0][0]   
__________________________________________________________________________________________________
expanded_conv_13/Add (Add)      (None, 15, 20, 160)  0           expanded_conv_12/project/BatchNor
                                                                 expanded_conv_13/project/BatchNor
__________________________________________________________________________________________________
expanded_conv_14/expand (Conv2D (None, 15, 20, 960)  153600      expanded_conv_13/Add[0][0]       
__________________________________________________________________________________________________
expanded_conv_14/expand/BatchNo (None, 15, 20, 960)  3840        expanded_conv_14/expand[0][0]    
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 15, 20, 960)  0           expanded_conv_14/expand/BatchNorm
__________________________________________________________________________________________________
expanded_conv_14/depthwise (Dep (None, 15, 20, 960)  8640        activation_29[0][0]              
__________________________________________________________________________________________________
expanded_conv_14/depthwise/Batc (None, 15, 20, 960)  3840        expanded_conv_14/depthwise[0][0] 
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 15, 20, 960)  0           expanded_conv_14/depthwise/BatchN
__________________________________________________________________________________________________
expanded_conv_14/project (Conv2 (None, 15, 20, 160)  153600      activation_30[0][0]              
__________________________________________________________________________________________________
expanded_conv_14/project/BatchN (None, 15, 20, 160)  640         expanded_conv_14/project[0][0]   
__________________________________________________________________________________________________
expanded_conv_14/Add (Add)      (None, 15, 20, 160)  0           expanded_conv_13/Add[0][0]       
                                                                 expanded_conv_14/project/BatchNor
__________________________________________________________________________________________________
Conv_1 (Conv2D)                 (None, 15, 20, 960)  153600      expanded_conv_14/Add[0][0]       
__________________________________________________________________________________________________
Conv_1/BatchNorm (BatchNormaliz (None, 15, 20, 960)  3840        Conv_1[0][0]                     
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 15, 20, 960)  0           Conv_1/BatchNorm[0][0]           
==================================================================================================
Total params: 1,437,608
Trainable params: 1,413,208
Non-trainable params: 24,400
__________________________________________________________________________________________________
